---
kind: property
id: P:Autodesk.Revit.DB.Mesh.DistributionOfNormals
source: html/754f7588-e258-84b1-0f48-8dc6fa57f192.htm
---
# Autodesk.Revit.DB.Mesh.DistributionOfNormals Property

Indicates the distribution of normal vectors along the tessellated mesh surface.

## Syntax (C#)
```csharp
public DistributionOfNormals DistributionOfNormals { get; }
```